<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6172bf0046e6e6eded376036cf3949ee0abea4b8b2996ba9100b4cf581bdeaac","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1344 at https://github.com/cal-itp/data-infra/actions/runs/20969952839","plan_out_hash":"3926336470858711c15c224e0ae8eb0a99c2785043d2960e0e6abead9292ceb0","plan_hash":"79a9b3ddb4f6efb60feac8edb00dfe3866b5ef6f9069a7196176c9a5e4f48a98","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "T/QO7Q==" -> (known after apply)
!~      detect_md5hash      = "CmhUy7xIqmzufuxcCXV1yg==" -> "different hash"
!~      generation          = 1767986257222525 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "CmhUy7xIqmzufuxcCXV1yg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/payments/_payments.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "u7oQTQ==" -> (known after apply)
!~      detect_md5hash      = "wLmnrdN+f5tBA3MWS+icfg==" -> "different hash"
!~      generation          = 1757032590670911 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/payments/_payments.yml"
!~      md5hash             = "wLmnrdN+f5tBA3MWS+icfg==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/_payments.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Hnb9/g==" -> (known after apply)
!~      detect_md5hash      = "o51gEzjpdSI4kBOeprhY4g==" -> "different hash"
!~      generation          = 1767986258659920 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "o51gEzjpdSI4kBOeprhY4g==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1344](https://github.com/cal-itp/data-infra/actions/runs/20969952839)